{"inkVersion":21,"root":[[{"->":"Begin"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Begin":[["#","^name Luke","/#","^Guys, look at THIS!","\n","#","^name empty","/#","^(This is Luke. He is one of your high school friends, and ended up on the same college as you, even though on different courses.)","\n","#","^name Luke","/#","^I'm RICH!! Finally, after months of spending my part-time earnings on this, I DID IT!","\n","#","^name empty","/#","^(What?)","\n","ev","str","^Did you really spent your salary on this?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^What are you blabbering about, dude?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"SkipLunch"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Explain"},"\n",{"#f":5}]}],{"#f":1}],"SkipLunch":["#","^name Luke","/#","^YOU BET I DID. All I had to do was to have chips and some cheap instant food for lunch a few days during the week to save money and keep buying loads of these until I got the prize.","\n",{"->":"continue1"},{"#f":1}],"Explain":["#","^name Luke","/#","^I SAID I will BUY you a FREAKING house in CALIFORNIA, BABY. I just won the LOTTERY.","\n",{"->":"continue1"},{"#f":1}],"continue1":[["#","^name Sophie","/#","^Do you want the whole world to know that you won a lot of money, dumbass?? Shut up and come here you two.","\n","#","^name empty","/#","^(This is Sophie. She is an exchange student from your class that became friends with you and Luke. She is way more mature than her age, and is the most rational member of the trio.)","\n","#","^name Sophie","/#","^Okay, here in the corner is better.","\n","#","^name Sophie","/#","^Now tell the whole story, Luke.","\n","#","^name Luke","/#","^So, here is the deal.","\n","#","^name Luke","/#","^I asked for one of my friends from Computer Science to do some \"research\" on the pattern of lottery winners and he gave me a list of possible selling points, so I've been spending a part of my salary on all of them.","\n","#","^name Luke","/#","^And since today was a beautiful day, I decided to try my luck once again, and on my way here, I scratched and BOOM. One MILLION euros!!!","\n","#","^name empty","/#","^(That's actually amazing.)","\n","ev","str","^I'm pretty sure you just spent all the luck from your whole family right there.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^This story is suspicious in so many levels, man.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"luck"},"\n",{"#f":5}],"c-1":["^ ",{"->":"susp"},"\n",{"#f":5}]}],{"#f":1}],"luck":["#","^name Luke","/#","^I KNOW, RIGHT!?","\n","#","^name Luke","/#","^Now that you mention it, I also used some of the money to buy a new energy drink I saw on a vending machine nearby the lottery store.","\n","#","^name Luke","/#","^This is a pretty convenient branding of energy drink, don't you think?","\n",{"->":"continue2"},{"#f":1}],"susp":["#","^name Luke","/#","^There is nothing suspicious mate, is just PLAIN LUCK.","\n","#","^name Luke","/#","^In fact, look at this.","\n","#","^name Luke","/#","^I used some of the money to buy this energy drink before buying the lottery tickets, just to feel luckier.","\n",{"->":"continue2"},{"#f":1}],"continue2":["#","^name Sophie","/#","^What a weird energy drink... I never saw any ad about it, and normally energy drink brands love to create ads on social media.","\n","#","^name empty","/#","^(You felt slightly uneasy when holding that energy drink can. The smell was refreshing and normal, and the ingredients on the label weren't any different from normal energy drinks. But still, something was bothering you. Yet, you couldn't allow this feeling to ruin that moment.)","\n","#","^name Sophie","/#","^But that doesn't matter now, right? You are rich and we MUST go show this to your parents so that they can cash out the money!!!","\n","#","^name Luke","/#","done","end",{"#f":1}],"#f":1}],"listDefs":{}}